In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
import _plot_utils as pu

In [4]:
pu.plot_style('notebook')

# Pandas DataFrame - introduction

pandas DataFrame - class to manupulate 2-d array with a whole lot of build-in functions based on Numpy Arrays

In [5]:
# simple DataFrame
pd.DataFrame([[1,2,3], [4,5,6]])

   0  1  2
0  1  2  3
1  4  5  6

In [6]:
# Data Frame can have values of mixed types:
df = pd.DataFrame(
    [
        ['one',  10, np.random.rand()], 
        ['two',  20, np.random.rand()],
        ['three',30, np.random.rand()],
        ['four', 40, np.random.rand()],
    ]
)

In [7]:
df

       0   1         2
0    one  10  0.049086
1    two  20  0.904188
2  three  30  0.405307
3   four  40  0.594230

In [8]:
df.dtypes

0     object
1      int64
2    float64
dtype: object

In [9]:
# DataFrame consists of columns: 
df.columns

RangeIndex(start=0, stop=3, step=1)

In [10]:
# select data from column=0
df[0]

0      one
1      two
2    three
3     four
Name: 0, dtype: object

In [11]:
# and rows:
df.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
# select data from row=0
df.loc[0]

0          one
1           10
2    0.0490864
Name: 0, dtype: object

In [13]:
# columns can be named (it's actually a best practice)
df = df.rename(columns = {0: 'label', 1: 'some_value', 2: 'some_number'})

In [14]:
df

   label  some_value  some_number
0    one          10     0.049086
1    two          20     0.904188
2  three          30     0.405307
3   four          40     0.594230

In [15]:
df.columns

Index(['label', 'some_value', 'some_number'], dtype='object')

In [16]:
# Named columns can be accesed as:
df['some_value']

0    10
1    20
2    30
3    40
Name: some_value, dtype: int64

In [17]:
# or like this:
df.some_value

0    10
1    20
2    30
3    40
Name: some_value, dtype: int64

In [18]:
# Rows index can be changed:

In [19]:
df = df.set_index('label')
df.index

Index(['one', 'two', 'three', 'four'], dtype='object', name='label')

In [20]:
df

       some_value  some_number
label
one            10     0.049086
two            20     0.904188
three          30     0.405307
four           40     0.594230

In [21]:
# reset_index() can reindex back to row numbers:
df.reset_index()

   label  some_value  some_number
0    one          10     0.049086
1    two          20     0.904188
2  three          30     0.405307
3   four          40     0.594230

## Accessing DataFrame data

In [22]:
# single DataFrame column is a pd.Series:
df['some_number']

label
one      0.049086
two      0.904188
three    0.405307
four     0.594230
Name: some_number, dtype: float64

In [23]:
type(df['some_number'])

pandas.core.series.Series

In [24]:
# Series have np.ndarray inside:
print(df['some_number'].values, type(df['some_number'].values))

[0.04908644 0.90418796 0.40530717 0.59422978] <class 'numpy.ndarray'>

In [25]:
# selecting multiple DataFrame columns:
df[['some_number', 'some_value']]

       some_number  some_value
label
one       0.049086          10
two       0.904188          20
three     0.405307          30
four      0.594230          40

In [26]:
# Notice the difference: 
df['some_value']

label
one      10
two      20
three    30
four     40
Name: some_value, dtype: int64

In [27]:
# and:
df[['some_value']]

       some_value
label
one            10
two            20
three          30
four           40

#### Slicing data

In [28]:
# selecting rows based on index values df.loc[]:
df.loc['one']

some_value     10.000000
some_number     0.049086
Name: one, dtype: float64

In [29]:
df.loc['one':'two']

       some_value  some_number
label
one            10     0.049086
two            20     0.904188

In [30]:
df.loc['two':'four']

       some_value  some_number
label
two            20     0.904188
three          30     0.405307
four           40     0.594230

In [31]:
# notice the difference - df.iloc[] use numeric index of index value, not value itself:
print(df.index.values, '\n')
print(df.iloc[2])

['one' 'two' 'three' 'four']

some_value     30.000000
some_number     0.405307
Name: three, dtype: float64

#### Boolean indexing

In [32]:
# selec rows based on values:
df[df.some_value == 20]

       some_value  some_number
label
two            20     0.904188

In [33]:
# or using Boolean indexer:
condition = df.some_value > 20

In [34]:
# condition is a Boolean index now:
condition

label
one      False
two      False
three     True
four      True
Name: some_value, dtype: bool

In [35]:
# and we can use the indexer to get rows:
df.loc[condition]

       some_value  some_number
label
three          30     0.405307
four           40     0.594230

In [36]:
df[condition]

       some_value  some_number
label
three          30     0.405307
four           40     0.594230

In [37]:
df[~condition]

       some_value  some_number
label
one            10     0.049086
two            20     0.904188

In [38]:
condition2 = df.some_value != 40

In [39]:
df[condition & condition2]

       some_value  some_number
label
three          30     0.405307

In [40]:
df[condition | condition2]

       some_value  some_number
label
one            10     0.049086
two            20     0.904188
three          30     0.405307
four           40     0.594230

In [41]:
# alternate syntax:
df.query("some_value > 20 and some_value != 40")

       some_value  some_number
label
three          30     0.405307

### Link vs Copy

In [28]:
# everything in Python is a link
df1 = pd.DataFrame(np.arange(15).reshape(5,3))
df1

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [29]:
new_df = df1.loc[:, 1:2]
new_df

    1   2
0   1   2
1   4   5
2   7   8
3  10  11
4  13  14

In [42]:
# if we update value in new_df
new_df[1][0] = 17
new_df

C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

    0   1   2
0   0  17   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [43]:
# original DataFrame will also be updated:
df1

    0   1   2
0   0  17   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [44]:
# if need to avoid this, use copy() or copy=True:
copy_df = df1.loc[:, 1:2].copy()
copy_df

    1   2
0  17   2
1   4   5
2   7   8
3  10  11
4  13  14

In [45]:
copy_df[1][0] = 100
copy_df

     1   2
0  100   2
1    4   5
2    7   8
3   10  11
4   13  14

In [46]:
df1

    0   1   2
0   0  17   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

### Vectorized functions

In [42]:
df

       some_value  some_number
label
one            10     0.049086
two            20     0.904188
three          30     0.405307
four           40     0.594230

In [43]:
# pd.Series is a Numpy array - vectorized functions can be applyed the same way:
df.some_value.sum()

100

In [44]:
df.some_number.max()

0.9041879618093317

In [45]:
# There are DataFrame-level function too:
df.min()

some_value     10.000000
some_number     0.049086
dtype: float64

In [46]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
some_value,4.0,25.000000,12.909944,10.000000,17.500000,25.000000,32.500000,40.000000
some_number,4.0,0.488203,0.357762,0.049086,0.316252,0.499768,0.671719,0.904188

### Apply, Assign, Map

In [4]:
some_map = {'g': 'green', 'r':'red'}

In [8]:
some_df = pd.DataFrame(['r', 'g', 'b'], columns=['colors'])
some_df

  colors
0      r
1      g
2      b

In [10]:
# map function applied to Series lookks up values in provided dict:
some_df.colors.map(some_map)

0      red
1    green
2      NaN
Name: colors, dtype: object

In [11]:
# Assign method created new DataFrame coulms and assigns value:
some_df.assign(some_value = 'acb')

  colors some_value
0      r        acb
1      g        acb
2      b        acb

In [12]:
some_df.assign(another_value = [13,45,57])

  colors  another_value
0      r             13
1      g             45
2      b             57

In [15]:
some_df.assign(color_name = lambda x: x.colors.map(some_map))

  colors color_name
0      r        red
1      g      green
2      b        NaN

### GroupBy

In [53]:
numbers = np.arange(1000)
labels = np.array(['class 1', 'class 2', 'class 3'])
df = pd.DataFrame({'value': numbers, 'label':np.random.choice(labels, 1000)})
df.sample(5)

     value    label
126    126  class 2
752    752  class 2
97      97  class 2
833    833  class 1
982    982  class 3

In [54]:
df.groupby('label').size()

label
class 1    337
class 2    343
class 3    320
dtype: int64

In [55]:
df.groupby('label').sum()

          value
label
class 1  165167
class 2  168677
class 3  165656

In [62]:
df['new_value'] = round(df.value / 100)

In [63]:
df.groupby('label').max()

         value  new_value
label
class 1    996       10.0
class 2    997       10.0
class 3    999       10.0

In [64]:
df.groupby('label').agg({'value':'sum', 'new_value':'min'})

          value  new_value
label
class 1  165167        0.0
class 2  168677        0.0
class 3  165656        0.0

In [60]:
df.groupby('label').agg(['min', 'max'])

        value      new_value
          min  max       min   max
label
class 1     0  996      0.00  9.96
class 2     3  997      0.03  9.97
class 3     9  999      0.09  9.99

In [69]:
df.groupby(['new_value', 'label']).value.nunique()

new_value  label
0.0        class 1    18
           class 2    21
           class 3    12
1.0        class 1    32
           class 2    41
           class 3    26
2.0        class 1    40
           class 2    26
           class 3    35
3.0        class 1    32
           class 2    34
           class 3    33
4.0        class 1    28
           class 2    41
           class 3    32
5.0        class 1    44
           class 2    22
           class 3    33
6.0        class 1    37
           class 2    33
           class 3    31
7.0        class 1    23
           class 2    43
           class 3    33
8.0        class 1    34
           class 2    37
           class 3    30
9.0        class 1    34
           class 2    32
           class 3    33
10.0       class 1    15
           class 2    13
           class 3    22
Name: value, dtype: int64

In [71]:
df.groupby(['new_value', 'label']).value.nunique().unstack()

label      class 1  class 2  class 3
new_value
0.0             18       21       12
1.0             32       41       26
2.0             40       26       35
3.0             32       34       33
4.0             28       41       32
5.0             44       22       33
6.0             37       33       31
7.0             23       43       33
8.0             34       37       30
9.0             34       32       33
10.0            15       13       22

### Methods Chaining

In [72]:
(df
 .groupby(['new_value', 'label'])
 .value.nunique()
 .unstack()
)

label      class 1  class 2  class 3
new_value
0.0             18       21       12
1.0             32       41       26
2.0             40       26       35
3.0             32       34       33
4.0             28       41       32
5.0             44       22       33
6.0             37       33       31
7.0             23       43       33
8.0             34       37       30
9.0             34       32       33
10.0            15       13       22

In [79]:
(df
 .groupby(['new_value', 'label'])
 .value.nunique()
 .unstack()
 #.assign(total = lambda x: x.sum(axis=1))
 #.apply(lambda x: x*100) 
)#.plot()

label      class 1  class 2  class 3
new_value
0.0             18       21       12
1.0             32       41       26
2.0             40       26       35
3.0             32       34       33
4.0             28       41       32
5.0             44       22       33
6.0             37       33       31
7.0             23       43       33
8.0             34       37       30
9.0             34       32       33
10.0            15       13       22